ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_epwm_xcmp_regs.xml
	<register id="XCMP1_ACTIVE" width="32" page="0" offset="0x200" instances="1" instaddr="4" internal="0" description="Additional Compare 1 Active Register">
		<bitfield id="XCMP1HR_ACTIVE" description="Additional Compare 1 Active HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP1_ACTIVE" description="Additional Compare 1 Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP2_ACTIVE" width="32" page="0" offset="0x204" instances="1" instaddr="4" internal="0" description="Additional Compare 2 Active Register">
		<bitfield id="XCMP2HR_ACTIVE" description="Additional Compare 2 Active HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP2_ACTIVE" description="Additional Compare 2 Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP3_ACTIVE" width="32" page="0" offset="0x208" instances="1" instaddr="4" internal="0" description="Additional Compare 3 Active Register">
		<bitfield id="XCMP3HR_ACTIVE" description="Additional Compare 3 Active HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP3_ACTIVE" description="Additional Compare 3 Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP4_ACTIVE" width="32" page="0" offset="0x20c" instances="1" instaddr="4" internal="0" description="Additional Compare 4 Active Register">
		<bitfield id="XCMP4HR_ACTIVE" description="Additional Compare 4 Active HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP4_ACTIVE" description="Additional Compare 4 Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP5_ACTIVE" width="32" page="0" offset="0x210" instances="1" instaddr="4" internal="0" description="Additional Compare 5 Active Register">
		<bitfield id="XCMP5HR_ACTIVE" description="Additional Compare 5 Active HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP5_ACTIVE" description="Additional Compare 5 Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP6_ACTIVE" width="32" page="0" offset="0x214" instances="1" instaddr="4" internal="0" description="Additional Compare 6 Active Register">
		<bitfield id="XCMP6HR_ACTIVE" description="Additional Compare 6 Active HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP6_ACTIVE" description="Additional Compare 6 Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP7_ACTIVE" width="32" page="0" offset="0x218" instances="1" instaddr="4" internal="0" description="Additional Compare 7 Active Register">
		<bitfield id="XCMP7HR_ACTIVE" description="Additional Compare 7 Active HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP7_ACTIVE" description="Additional Compare 7 Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP8_ACTIVE" width="32" page="0" offset="0x21c" instances="1" instaddr="4" internal="0" description="Additional Compare 8 Active Register">
		<bitfield id="XCMP8HR_ACTIVE" description="Additional Compare 8 Active HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP8_ACTIVE" description="Additional Compare 8 Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XTBPRD_ACTIVE" width="32" page="0" offset="0x220" instances="1" instaddr="4" internal="0" description="Additional Time Base Period Active Register">
		<bitfield id="XTBPRDHR_ACTIVE" description="Additional Time Base Period Active HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XTBPRD_ACTIVE" description="Additional Time Base Period Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XAQCTLA_ACTIVE" width="16" page="0" offset="0x230" instances="1" instaddr="2" internal="0" description="AQCTLA Active Register">
		<bitfield id="XCMP1" description="XCMP1 Action" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="XCMP2" description="XCMP2 Action" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="XCMP3" description="XCMP3 Action" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="XCMP4" description="XCMP4 Action" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="XCMP5" description="XCMP5 Action" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="XCMP6" description="XCMP6 Action" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="XCMP7" description="XCMP7 Action" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="XCMP8" description="XCMP8 Action" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="XAQCTLB_ACTIVE" width="16" page="0" offset="0x232" instances="1" instaddr="2" internal="0" description="AQCTLB Active Register">
		<bitfield id="XCMP5" description="XCMP5 Action" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="XCMP6" description="XCMP6 Action" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="XCMP7" description="XCMP7 Action" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="XCMP8" description="XCMP8 Action" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="XMINMAX_ACTIVE" width="32" page="0" offset="0x244" instances="1" instaddr="4" internal="0" description="XMINMAX Active Register">
		<bitfield id="XMAX_ACTIVE" description="Maximum Valude  for Capture Counter Active Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XMIN_ACTIVE" description="Minimum Valude  for Capture Counter Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP1_SHDW1" width="32" page="0" offset="0x280" instances="1" instaddr="4" internal="0" description="Additional Compare 1 Shadow 1 Register">
		<bitfield id="XCMP1HR_SHDW1" description="Additional Compare 1 Shadow 1 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP1_SHDW1" description="Additional Compare 1 Shadow 1 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP2_SHDW1" width="32" page="0" offset="0x284" instances="1" instaddr="4" internal="0" description="Additional Compare 2 Shadow 1 Register">
		<bitfield id="XCMP2HR_SHDW1" description="Additional Compare 2 Shadow 1 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP2_SHDW1" description="Additional Compare 2 Shadow 1 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP3_SHDW1" width="32" page="0" offset="0x288" instances="1" instaddr="4" internal="0" description="Additional Compare 3 Shadow 1 Register">
		<bitfield id="XCMP3HR_SHDW1" description="Additional Compare 3 Shadow 1 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP3_SHDW1" description="Additional Compare 3 Shadow 1 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP4_SHDW1" width="32" page="0" offset="0x28c" instances="1" instaddr="4" internal="0" description="Additional Compare 4 Shadow 1 Register">
		<bitfield id="XCMP4HR_SHDW1" description="Additional Compare 4 Shadow 1 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP4_SHDW1" description="Additional Compare 4 Shadow 1 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP5_SHDW1" width="32" page="0" offset="0x290" instances="1" instaddr="4" internal="0" description="Additional Compare 5 Shadow 1 Register">
		<bitfield id="XCMP5HR_SHDW1" description="Additional Compare 5 Shadow 1 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP5_SHDW1" description="Additional Compare 5 Shadow 1 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
